Repository: Mahmoudhodhod/Rasikh
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Home
ar: الرئيسة

# appTitle
source: Rasikh
ar: راسخ

# homeWelcome
source: Welcome to Rasikh App
ar: مرحبًا بك في تطبيق راسخ

source: Go to settings
ar: اذهب إلى الإعدادات

source: Settings
ar: الإعدادات

source: Dark mode
ar: الوضع الداكن

source: Language
ar: اللغة

# welcomeMessage
source: Welcome 👋
ar: مرحبًا بك 👋

source: Home Page
ar: الصفحة الرئيسة

source: Contact Us
ar: تواصل معنا

source: Logout
ar: تسجيل الخروج

# appVersion
source: Version 1.0.0
ar: إصدار 1.0.0

# languageEnglish
source: English
ar: الإنجليزية

# languageArabic
source: Arabic
ar: العربية

# resourcesHubTitle
source: Resources
ar: المصادر

# tafsirAndTadabburTab
source: Tafsir & Tadabbur
ar: تفسير وتدبر

# tajweedTab
source: Tajweed
ar: التجويد

# tafsirDetailTitle
source: Tafsir of Ayah {verseNumber} from Surah {surahName}
ar: تفسير الآية {verseNumber} من سورة {surahName}

# tafsirLabel
source: Tafsir:
ar: التفسير:

# searchBySurahNameHint
source: Search by Surah name
ar: بحث باسم السورة

# searchByVerseNumberHint
source: Search by Ayah number
ar: بحث برقم الآية

# surahNameLabel
source: Surah {surahName}
ar: سورة {surahName}

# verseNumberLabel
source: Ayah {verseNumber}
ar: آية {verseNumber}

# viewTafsirButton
source: View Tafsir
ar: عرض التفسير

source: Example:
ar: 'أمثلة:'

# certificateScreenTitle
source: Certificate of Appreciation
ar: شهادة تقدير

# downloadAsPdfButton
source: Download as PDF
ar: تحميل بصيغة PDF

# certificateTitle
source: Certificate for Memorizing {courseName}
ar: شهادة تقدير حفظ {courseName}

# certificatePresentedTo
source: This certificate is presented to:
ar: هذه الشهادة مقدمة لـ:

# certificateBlessing
source: May Allah bless you and make your memorization of the Quran a light for you in this life and the hereafter.
ar: بارك الله فيك وجعل حفظك للقرآن نورًا لك في الدنيا والآخرة.

# signatureLabel
source: Signature ___________________
ar: ___________________ التوقيع

# certificateCompletionTitle
source: Certificate of Completion for Part {partNumber}
ar: شهادة إتمام الجزء {partNumber}

# certificateIssueDate
source: Issue Date: {date}
ar: تاريخ الإصدار: {date}

source: No Certificates Found
ar: لا يوجد شهادات

# performanceTrackingTitle
source: Performance Tracking
ar: متابعة الأداء

# reportsTab
source: Reports
ar: التقارير

# certificatesTab
source: Certificates
ar: الشهادات

# prophetSaidLabel
source: The Messenger of Allah ﷺ said:
ar: قال رسول الله ﷺ:

# memorizationReportTitle
source: Memorization Report
ar: تقرير الحفظ

# savedVersesStatTitle
source: Memorized Verses
ar: عدد الآيات المحفوظة

# savedVersesStatUnit
source: verse
ar: آية

# savedPagesStatTitle
source: Memorized Pages
ar: عدد الأوجه المحفوظة

# savedPagesStatUnit
source: page
ar: وجه

# savedJuzStatTitle
source: Memorized Juz'
ar: عدد الأجزاء المحفوظة

# savedJuzStatUnit
source: Juz'
ar: جزء

# dailyAverageStatTitle
source: Daily Average
ar: المتوسط اليومي للحفظ

# dailyAverageStatUnit
source: verses
ar: آيات

# profileScreenTitle
source: Profile
ar: الملف الشخصي

# personalInformationTitle
source: Personal Information
ar: المعلومات الشخصية

# addressInformationTitle
source: Address Information
ar: معلومات العنوان

# editButton
source: Edit
ar: تعديل

# firstNameLabel
source: First Name
ar: الاسم الأول

# middleNameLabel
source: Middle Name
ar: الاسم الأوسط

# lastNameLabel
source: Last Name
ar: الاسم الأخير

# emailLabel
source: Email
ar: البريد الإلكتروني

# phoneLabel
source: Phone Number
ar: رقم الهاتف

# passwordLabel
source: Password
ar: كلمة السر

# logoutButton
source: Logout
ar: تسجيل الخروج

# profileLoadError
source: Failed to load profile: {error}
ar: فشل تحميل الملف الشخصي: {error}

# retryButton
source: Retry
ar: إعادة المحاولة

# editProfileDialogTitle
source: Edit Personal Information
ar: تعديل المعلومات الشخصية

# firstNameFormFieldLabel
source: First Name
ar: الاسم الأول

# middleNameFormFieldLabel
source: Middle Name
ar: الاسم الأوسط

# lastNameFormFieldLabel
source: Last Name
ar: الاسم الأخير

# emailFormFieldLabel
source: Email
ar: البريد الإلكتروني

# phoneFormFieldLabel
source: Mobile Number
ar: رقم الجوال

# cancelButton
source: Cancel
ar: إلغاء

# saveButton
source: Save
ar: حفظ

# validationEmptyFirstName
source: Please enter your first name
ar: الرجاء إدخال الاسم الأول

# validationInvalidNameFormat
source: Name must contain letters only
ar: الاسم يجب أن يحتوي على حروف فقط

# validationEmptyMiddleName
source: Please enter your middle name
ar: الرجاء إدخال الاسم الأوسط

# validationEmptyLastName
source: Please enter your last name
ar: الرجاء إدخال الاسم الأخير

# validationEmptyEmail
source: Please enter your email
ar: الرجاء إدخال البريد الإلكتروني

# validationInvalidEmail
source: Please enter a valid email address
ar: بريد إلكتروني غير صالح

# invalidPhoneNumber
source: Invalid mobile number
ar: رقم الجوال غير صالح

# changePasswordDialogTitle
source: Change Password
ar: تغيير كلمة المرور

# oldPasswordFormFieldLabel
source: Old Password
ar: كلمة المرور القديمة

# newPasswordFormFieldLabel
source: New Password
ar: كلمة المرور الجديدة

# confirmNewPasswordFormFieldLabel
source: Confirm New Password
ar: تأكيد كلمة المرور الجديدة

# validationEmptyOldPassword
source: Please enter your old password
ar: الرجاء إدخال كلمة المرور القديمة

# validationEmptyNewPassword
source: Please enter the new password
ar: الرجاء إدخال كلمة المرور الجديدة

# validationPasswordTooShort
source: Password is too short
ar: كلمة المرور قصيرة

# validationPasswordsDoNotMatch
source: Passwords do not match
ar: كلمتا المرور غير متطابقتين

# editAddressDialogTitle
source: Edit Address
ar: تعديل العنوان

# countryFormFieldLabel
source: Country
ar: البلد

# cityFormFieldLabel
source: City
ar: المدينة

# addressDetailsFormFieldLabel
source: Address Details
ar: العنوان بالتفاصيل

# validationEmptyCountry
source: Please enter the country
ar: الرجاء إدخال البلد

# validationEmptyCity
source: Please enter the city
ar: الرجاء إدخال المدينة

# validationEmptyAddressDetails
source: Please enter address details
ar: الرجاء إدخال التفاصيل

# profileUpdateSuccess
source: Information updated successfully
ar: تم تحديث المعلومات بنجاح

# profileUpdateFailed
source: Update failed: {error}
ar: فشل التحديث: {error}

# passwordUpdateSuccess
source: Password changed successfully
ar: تم تغيير كلمة المرور بنجاح

# oldPasswordIncorrect
source: Old password is incorrect
ar: كلمة المرور القديمة غير صحيحة

# addressUpdateSuccess
source: Address updated successfully
ar: تم تحديث العنوان بنجاح

# apiConnectionTimeout
source: Connection timeout with server.
ar: انتهت مهلة الاتصال بالخادم.

# apiBadRequest
source: Invalid request. Please check your input.
ar: طلب غير صالح. يرجى مراجعة البيانات المدخلة.

# apiUnauthorized
source: Incorrect login credentials.
ar: بيانات الدخول غير صحيحة.

# apiNotFound
source: Requested resource not found.
ar: لم يتم العثور على المورد المطلوب.

# apiPhoneNumberExists
source: Phone number already exists.
ar: رقم الهاتف مستخدم بالفعل.

# apiServerError
source: Server error, please try again later.
ar: حدث خطأ في الخادم، يرجى المحاولة لاحقًا.

# apiUnexpectedErrorWithCode
source: Unexpected error: {statusCode}
ar: حدث خطأ غير متوقع: {statusCode}

# apiRequestCancelled
source: Request cancelled.
ar: تم إلغاء الطلب.

# apiNoInternetConnection
source: No internet connection.
ar: لا يوجد اتصال بالإنترنت.

# apiUnknownError
source: Unknown error occurred.
ar: حدث خطأ غير معروف.

# apiUnexpectedError
source: Unexpected error occurred, please try again.
ar: حدث خطأ غير متوقع, يرجى المحاولة مرة أخرى.

# apiOldPasswordIncorrect
source: The old password is incorrect.
ar: كلمة المرور القديمة غير صحيحة.

source: Welcome Back 👋
ar: مرحبًا بعودتك 👋

# loginPrompt
source: Please enter your email and password to login
ar: الرجاء إدخال البريد الإلكتروني وكلمة المرور لتسجيل الدخول

# phoneNumberLabel
source: Phone Number
ar: رقم الهاتف

# validationEnterPhoneNumber
source: Please enter phone number
ar: الرجاء إدخال رقم الهاتف

# validationEnterPassword
source: Please enter password
ar: الرجاء إدخال كلمة المرور

# forgotPasswordButton
source: Forgot Password?
ar: نسيت كلمة المرور؟

# loginButton
source: Login
ar: تسجيل الدخول

# dontHaveAccount
source: Don't have an account?
ar: ليس لديك حساب؟

# createAccountButton
source: Create Account
ar: إنشاء حساب

# registerTitle
source: Create New Account
ar: إنشاء حساب جديد

# stepBasicInfo
source: Basic Info
ar: البيانات الأساسية

# stepDetails
source: Details
ar: التفاصيل

# registerWelcome
source: Welcome 👋
ar: أهلاً بك 👋

# registerWelcomeSub
source: Let's start with some basic information to create your profile.
ar: لنبدأ ببعض المعلومات الأساسية لإنشاء ملفك الشخصي.

# fullNameLabel
source: Full Name
ar: الاسم الكامل

# ageLabel
source: Age
ar: العمر

# nextButton
source: Next
ar: التالي

# step2Title
source: Last Step! 🚀
ar: خطوة أخيرة! 🚀

# step2Sub
source: Help us customize your experience with these details.
ar: ساعدنا في تخصيص تجربتك من خلال هذه التفاصيل.

# countryLabel
source: Country
ar: الدولة

# validationCountryRequired
source: Country is required
ar: الدولة مطلوبة

# planSelectionTitle
source: How do you prefer to memorize?
ar: كيف تفضل أن تحفظ؟

# planSelfPaced
source: Self-Paced
ar: حفظ ذاتي

# planSelfPacedSub
source: Memorize alone and review whenever I want
ar: أحفظ بمفردي وأراجع متى شئت

# planGroup
source: Memorization Circle
ar: حلقة تحفيظ

# planGroupSub
source: Join a group for encouragement
ar: الانضمام لمجموعة تشجيعية

# planTutor
source: Private Tutor (Online)
ar: معلم خاص (عن بعد)

# planTutorSub
source: Close follow-up with a teacher
ar: متابعة دقيقة مع معلم

# validationPlanRequired
source: Please select a memorization plan
ar: الرجاء اختيار خطة الحفظ

# registerSuccess
source: Account created successfully!
ar: تم إنشاء الحساب بنجاح!

# createAccountAction
source: Create Account
ar: إنشاء الحساب

# loginOptionsTitle
source: Let's dive into your account
ar: دعنا نتعمق في حسابك

source: Login with Google
ar: تسجيل الدخول عبر جوجل

source: Login with Apple
ar: تسجيل الدخول عبر آبل

# orDivider
source: Or
ar: أو

# loginWithPhone
source: Login
ar: تسجيل الدخول

# forgotPasswordTitle
source: Reset Password
ar: إعادة تعيين كلمة المرور

# forgotPasswordHeading
source: Forgot Password?
ar: هل نسيت كلمة المرور؟

# forgotPasswordSub
source: If you are having trouble remembering the correct email, please contact support for assistance.
ar: إذا كنت تواجه مشكلة في تذكر البريد الإلكتروني الصحيح فلا تتردد في التواصل مع فريق الدعم الفني للمساعدة.

# enterEmailLabel
source: Enter Email
ar: أدخل البريد الإلكتروني

# startNowButton
source: Start Now
ar: ابدأ الآن

# backButton
source: Go Back
ar: العودة إلى الخلف

# otpTitle
source: Change Password
ar: تغيير كلمة المرور

# otpMessage
source: An activation code has been sent to your email. Please check and copy the code.
ar: تم إرسال رمز تفعيل لإعادة تعيين كلمة المرور إلى بريدك الإلكتروني. يرجى التحقق ونسخ الرمز.

# otpLabel
source: Activation Code
ar: كود التفعيل

# validationEnterCode
source: Please enter the code
ar: الرجاء إدخال الكود

# newPasswordLabel
source: New Password
ar: كلمة المرور الجديدة

# confirmPasswordLabel
source: Confirm Password
ar: إعادة كتابة كلمة المرور

# passwordResetSuccess
source: Password reset successfully
ar: تم تعيين كلمة المرور بنجاح

# finishButton
source: Finish
ar: إنهاء

# validationEmail
source: Please enter a valid email
ar: الرجاء إدخال بريد إلكتروني صالح

# validationPasswordLength
source: Password must be at least 6 characters
ar: كلمة المرور يجب أن تكون 6 أحرف على الأقل

# validationPasswordMismatch
source: Passwords do not match
ar: كلمتا المرور غير متطابقتين

# logoutTitle
source: Logout
ar: تسجيل الخروج

# logoutConfirmationTitle
source: Confirm Logout
ar: تأكيد تسجيل الخروج

# logoutConfirmationMessage
source: Are you sure you want to log out of the account?
ar: هل أنت متأكد أنك تريد تسجيل الخروج من الحساب؟

# logoutSuccess
source: Logged out successfully.
ar: تم تسجيل الخروج بنجاح.

# logoutQuestion
source: Do you want to log out of your account?
ar: هل تريد تسجيل الخروج من حسابك؟

# logoutFailed
source: Logout failed: {error}
ar: فشل تسجيل الخروج: {error}

# onboardingTitle1
source: Welcome to Rasikh
ar: مرحبًا بك في راسخ

# onboardingSub1
source: Your smart way to memorize the Quran and consolidate it in an organized and effective manner.
ar: طريقتك الذكية لحفظ القرآن الكريم وتثبيته بأسلوب منظم وفعال.

# onboardingTitle2
source: Flexible Plans
ar: خطط حفظ مرنة

# onboardingSub2
source: Choose the plan that suits your time and level, and track your progress day by day easily.
ar: اختر الخطة التي تناسب وقتك ومستواك، وتابع تقدمك يومًا بيوم بسهولة.

# onboardingTitle3
source: Smart Review & Quizzes
ar: مراجعة واختبارات ذكية

# onboardingSub3
source: A comprehensive review system helping you consolidate memorization, with tests to measure your mastery.
ar: نظام مراجعة متكامل يساعدك على تثبيت المحفوظ، مع اختبارات لقياس إتقانك.

# skipButton
source: Skip
ar: تخطي

# validationEnterName
source: Please enter the name
ar: الرجاء إدخال الاسم

# validationNameThreeParts
source: Please enter at least a full name (three parts)
ar: الرجاء إدخال الاسم الثلاثي على الأقل

# validationNameCharsOnly
source: Name must contain letters only
ar: الاسم يجب أن يحتوي على أحرف فقط

# validationValidEmail
source: Please enter a valid email
ar: الرجاء إدخال بريد إلكتروني صحيح

# validationEnterPhone
source: Please enter phone number
ar: الرجاء إدخال رقم الهاتف

# validationInvalidPhone
source: Invalid phone number
ar: رقم الهاتف غير صالح

# validationFieldRequired
source: Please enter {fieldName}
ar: الرجاء إدخال {fieldName}

# cameraOption
source: Camera
ar: الكاميرا

# galleryOption
source: Photo Gallery
ar: معرض الصور

# cancelOption
source: Cancel
ar: إلغاء

# cropImageTitle
source: Crop Image
ar: قص الصورة

# cropImageDone
source: Done
ar: تم

# cropImageCancel
source: Cancel
ar: إلغاء

# changePhotoAction
source: Change Photo
ar: تغيير الصورة

# contactUsTitle
source: Contact Us
ar: تواصل معنا

# contactUsHeader
source: Contact Us
ar: تواصل معنا

# contactInfoTitle
source: Feel free to contact us anytime
ar: لا تتردد في الاتصال بنا في أي وقت

# contactInfoSub
source: We will reply as soon as possible
ar: سوف نقوم بالرد في أسرع وقت ممكن

# contactTypeHint
source: Choose contact type
ar: اختر نوع التواصل

# contactTypeGeneral
source: General Inquiry
ar: استفسار عام

# contactTypeTechnical
source: Technical Complaint
ar: شكوى فنية

# contactTypeSuggestion
source: Development Suggestion
ar: اقتراح تطويري

# messageLabel
source: Your Message
ar: رسالتك

# validationMessageRequired
source: Please enter your message
ar: الرجاء كتابة رسالتك

# sendButton
source: Send
ar: إرسال

# messageSentSuccess
source: Your message has been sent successfully
ar: تم إرسال رسالتك بنجاح

# validationFillAllFields
source: Please make sure to fill all required fields ⚠️
ar: الرجاء التأكد من ملء جميع الحقول المطلوبة ⚠️

# dashboardTitle
source: Rasikh
ar: راسخ

# welcomeUser
source: Welcome, {userName}!
ar: مرحبًا بك، {userName}!

# welcomeSubtitle
source: Your journey with the Quran continues steadily!
ar: رحلتك مع القرآن مستمرة بخطى ثابتة!

# quoteText
source: Always remember: every verse you memorize raises you a degree, and every effort you make in memorization is a step towards light and blessing. Keep going, we are with you every step of the way!
ar: تذكّر دائمًا: كل آية تحفظها ترفعك درجة، وكل جهد تبذله في الحفظ هو خطوة نحو النور والبركة. واصل المسير، فنحن معك في كل خطوة!

# aboutUsTitle
source: About Us
ar: من نحن

# aboutUsContent
source: Rasikh is a high-level Quranic program aimed at writing, memorizing, listening, reviewing, and linking each section of the curriculum to be memorized, and indicating the student's achievement level for all of that. It aims to help male and female students around the world memorize the Holy Quran in an organized and effective manner, by providing an integrated system that combines paper plans and digital training.
ar: راسخ هو برنامج قراني رفيع المستوى، يهدف إلى الكتابة والحفظ والاستماع والمراجعة والربط لكل مقطع من المقرر المراد حفظه وبيان مستوى إنجاز الطالب لذلك كله. يهدف الي مساعدة الطلاب والطالبات في أنحاء العالم على حفظ القرآن الكريم بطريقة منظمة وفعالة، وذلك من خلال توفير نظام متكامل يجمع بين الخطط الورقية والتدريب الرقمي.

# completedParts
source: You have completed so far {count} of the Quran Juz'
ar: لقد أتممت حتى الآن {count} من أجزاء القرآن الكريم

# progressGood
source: Advanced & Good Level
ar: مستوى متقدم وجيد في الحفظ

# progressNeedsImprovement
source: Needs Improvement
ar: يحتاج الى تحسين

# progressNeedsIntensiveReview
source: Needs Intensive Review
ar: يحتاج الى مراجعة مكثفة

# nextTarget
source: 🌟 Next Target: {targetName}
ar: 🌟 الهدف القادم: {targetName}

# startMemorizingButton
source: Start Memorizing
ar: ابدأ الحفظ

# studentNamePlaceholder
source: Student Name
ar: اسم الطالب

# nextPartOrSurah
source: Next Part/Surah
ar: الجزء/السورة التالية

source: Welcome to Rasikh
ar: في تطبيق راسخ

# failedToLoadStatistics
source: Failed to load statistics: {error}
ar: فشل في تحميل الإحصائيات: {error}

# navHome
source: Home
ar: الرئيسية

# navMemorization
source: Memorization
ar: الحفظ

# navPerformance
source: Performance
ar: الأداء

# navUnderstanding
source: Understanding
ar: الفهم

# archiveScreenTitle
source: Archive
ar: الأرشيف

# planNamePlaceholder
source: 3 Months Plan
ar: خطة 3 شهور

# archiveLoadError
source: Failed to load archive: {error}
ar: فشل تحميل الأرشيف: {error}

# statusCompleted
source: Completed
ar: مكتمل

# statusIncomplete
source: Incomplete
ar: غير مكتمل

# detailMemorization
source: Memorization
ar: الحفظ

# detailReview
source: Review
ar: المراجعة

# detailRepetition
source: Repetition
ar: التكرار

# detailListening
source: Listening
ar: الاستماع

# detailLinking
source: Linking
ar: الربط

# detailWriting
source: Writing Verses
ar: كتابة الآيات

# writingCompleted
source: Done
ar: تمت

# writingNotCompleted
source: Not Done
ar: لم تتم

# memorizationInputHintLearning
source: Start typing...
ar: ابدأ الكتابة...

# memorizationInputHintTesting
source: Type the verses here to test your memorization...
ar: اكتب الآيات هنا للتحقق من حفظك...

# hintButton
source: Hint
ar: تلميح

# planLoadError
source: Error loading plan: {error}
ar: خطأ في تحميل الخطة: {error}

source: Start Writing
ar: ابدأ الكتابة

# planTitlePrefix
source: Plan:
ar: الخطة :

source: From Surah:
ar: من سورة:

source: From Ayah:
ar: من آية:

source: To Ayah:
ar: الى آية:

source: Review Mode
ar: وضع المراجعة

source: Memorization Mode
ar: وضع الحفظ

# startTypingBelow
source: Start typing in the field below...
ar: ابدأ الكتابة في الحقل أدناه...

# repetitionLabel
source: Repetition
ar: التكرار

# repetitionCount
source: {current} of {total}
ar: {current} من {total}

source: Listen Now
ar: استمع الآن

# writingAndRecitation
source: Writing
ar: الكتابة

source: Save Progress
ar: حفظ التقدم

source: Complete Memorization
ar: إتمام الحفظ

# planHubTitle
source: Memorization Tracker
ar: متابعة الحفظ

# tabMemorizationPlan
source: Memorization
ar: الحفظ

# tabLinking
source: Linking
ar: الربط

# tabArchive
source: Archive
ar: الأرشيف

# reviewBannerText
source: Do not forget that review consolidates memorization, so make your daily routine balanced between progress and review.
ar: لا تنسَ أن المراجعة تُثبّت الحفظ، فاجعل وردك اليومي متوازنًا بين التقدم والمراجعة.

# previousReviewTitle
source: Previous Review
ar: المراجعة السابقة

# nextReviewTitle
source: Next Review
ar: المراجعة التالية

# linkingTitle
source: Linking {surahName}
ar: ربط سورة {surahName}

# reviewButton
source: Review
ar: مراجعة

# linkButton
source: Link
ar: ربط

# fromSurahLabel
source: From Surah:
ar: من سورة:

# fromAyahLabel
source: From Ayah:
ar: من آية:

# toAyahLabel
source: To Ayah:
ar: إلى آية:

# noActivePlan
source: No active memorization plan
ar: لا توجد خطة نشطة

# apiNoActivePlan
source: No memorization plan scheduled for today.
ar: لا توجد خطة حفظ مجدولة لهذا اليوم.

# errorNoPlanTitle
source: No Plan Today
ar: لا توجد خطة اليوم

# errorNoInternetTitle
source: Connection Lost
ar: انقطع الاتصال

# errorGeneralTitle
source: Something Went Wrong
ar: حدث خطأ

# refreshButton
source: Refresh
ar: تحديث

# stopListening
source: Stop
ar: إيقاف

source: Error loading Surahs list
ar: خطأ في تحميل قائمة السور

# failedToLoadCertificates
source: Failed to load certificates: {errorMessage}
ar: فشل في تحميل الشهادات: {errorMessage}

source: Not Defined
ar: لم يتم التحديد

# noArchiveData
source: No archive data yet
ar: لا يوجد أرشيف حتى الآن

# validationRequiredField
source: Please enter {fieldName}
ar: الرجاء إدخال {fieldName}

# validationEnterAge
source: Please enter your age
ar: الرجاء إدخال العمر

# validationAgeNumberOnly
source: Age must be a valid integer number
ar: العمر يجب أن يكون رقمًا صحيحًا

# validationAgeRange
source: Please enter a realistic age between 15 and 120
ar: الرجاء إدخال عمر حقيقي بين 15 و 120

source: Failed to load countries
ar: فشل في تحميل البلدان

# searchCountryHint
source: Search for a country
ar: ابحث عن البلد

source: No results found
ar: لم يتم العثور على نتايج

source: Open in website
ar: فتح في الموقع

source: Uploading image...
ar: جاري رفع الصورة...

# imageUploadSuccess
source: Profile image updated successfully
ar: تم تحديث صورة الملف الشخصي بنجاح

# imageUploadFailed
source: Failed to upload image: {error}
ar: فشل رفع الصورة: {error}

# soryFailedToLoadReport
source: Sorry, failed to load report
ar: عذراً، فشل تحميل التقرير

# checkInternetThenRetry
source: Check your internet connection and try again
ar: تأكد من اتصالك بالإنترنت والمحاولة مرة أخرى

source: Surah number
ar: سورة رقم

source: No tafsir available for now.
ar: لا يوجد نص تفسير متاح حالياً.

# selectedSurahName
source: Al-Fatihah
ar: الفاتحة

source: Show all ayahs
ar: عرض جميع الآيات

# selectAyah
source: Select ayah number
ar: تحديد رقم الآية

source: Ayah number
ar: الآية رقم

# noAyahFound
source: No ayah found for this number in the current report
ar: لا توجد آية بهذا الرقم في النتائج الحالية

source: Get Certificate
ar: الحصول على الشهادة

source: Failed to load certificate
ar: فشل جلب الشهادة:

# certificateNotIssued
source: Certificate not issued yet, please try again later
ar: الشهادة قيد الإصدار، يرجى المحاولة لاحقاً

source: Number of saved parts
ar: عدد الأجزاء المحفوظة

# startNowThenYouWillSucceedInshaAllah
source: Start now and you will succeed inshaAllah!
ar: ابدأ الآن وستصل بإذن الله!

source: Date of Completion
ar: تاريخ الإنجاز

source: Error loading data
ar: خطاء في تحميل البيانات

source: Retry
ar: اعادة المحاولة

source: Loading...
ar: جاري التحميل

# completed
source: No action needed
ar: لا يوجد عملية متابعة

source: No plan selected
ar: لم يتم تحديد خطة

# reviewLinkScreenTitle
source: Review & Linking
ar: صفحة المراجعة والربط

# errorTitle
source: Oops! Something Went Wrong
ar: عفواً! حدث خطأ ما

source: Try Again
ar: إعادة المحاولة

# errorNoInternet
source: It looks like you're offline. Please check your internet connection and try again.
ar: يبدو أنك غير متصل بالإنترنت. يرجى التحقق من اتصالك والمحاولة مرة أخرى.

# errorTimeout
source: The connection took too long to respond. Please check your connection or try again later.
ar: استغرق الاتصال وقتاً طويلاً للرد. يرجى التحقق من اتصالك أو المحاولة لاحقاً.

# errorUnknown
source: An unexpected error occurred. Please restart the application.
ar: حدث خطأ غير متوقع. يرجى إعادة تشغيل التطبيق.

# errorGeneric
source: A problem occurred while loading the data.
ar: حدثت مشكلة أثناء تحميل البيانات.

# errorServerDown
source: We encountered a server issue (Code: {statusCode}). Please try again shortly.
ar: واجهنا مشكلة في الخادم (الكود: {statusCode}). يرجى المحاولة مرة أخرى قريباً.

# errorOccurredTitle
source: Error Occurred
ar: حدث خطاء
