Repository: Mahmoudhodhod/Rasikh
Catalog: lib/l10n/app_*.arb
Languages: ar

# errorOccurredMessage
source: An error occurred in the app. Please check your internet connection and try again.
ar: حدث خطاء في التطبيق. يرجى التحقق من اتصالك والمحاولة مرة أخرى.

# tajweedRulesTitle
source: Tajweed Rules
ar: قواعد التجويد

# validationPasswordWeak
source: Password must contain at least one letter or symbol
ar: يجب أن تحتوي كلمة المرور على حرف أو رمز واحد على الأقل

# userGuideTitle
source: User Guide
ar: دليل المستخدم

# welcomeTitle
source: Welcome to Rasikh 🌿
ar: مرحبًا بك في "راسخ" 🌿

# welcomeContent
source: This app is designed to be your smart companion in memorizing the Holy Quran. Our goal is not just memorization, but true mastery. We believe in integration, so you can follow your daily portion through the app or the website.
ar: تم تصميم هذا البرنامج ليكون رفيقك الذكي في رحلة حفظ كتاب الله. هدفنا ليس مجرد الحفظ، بل "الرسوخ". نحن نؤمن بالتكامل، لذا يمكنك متابعة وردك اليومي عبر التطبيق أو الموقع الإلكتروني.

# visitWebsite
source: Visit our website
ar: زيارة موقعنا الإلكتروني

# firstStepTitle
source: Step One: Choose Your Path
ar: الخطوة الأولى: اختيار المسار

# firstStepContent
source: We offer flexible plans that match your level and motivation. If you didn’t choose a plan during registration, you can explore and select the most suitable one now.
ar: لدينا خطط مرنة تناسب مستواك وهمتك. سواء كنت مبتدئاً أو متقدماً. إذا لم تقم باختيار خطتك أثناء التسجيل، يمكنك استعراض الخطط المتاحة واختيار الأنسب لك الآن.

# goToMemorization
source: Go to memorization page
ar: انتقل إلى صفحة الحفظ

# secondStepTitle
source: Step Two: Daily Portion
ar: الخطوة الثانية: الورد اليومي

# methodologyIntro
source: Rasikh’s secret lies in the triple methodology:
ar: سر "راسخ" يكمن في المنهجية الثلاثية:

source: Listen
ar: استمع

# listenDesc
source: Correct recitation
ar: لتصحيح التلاوة

source: Read
ar: اقرأ

# readDesc
source: With focus and reflection
ar: بتمعن وتركيز

source: Write
ar: اكتب

# writeDesc
source: To reinforce memorization
ar: لتثبيت الحفظ

# progressTitle
source: Step Three: Track Progress
ar: الخطوة الثالثة: متابعة الإنجاز

# progressContent
source: Your effort is never lost. Every completed day is recorded so you always know where you stand.
ar: حفظك لا يضيع! كل يوم تنجزه يتم توثيقه في الأرشيف لتعرف بالضبط أين تقف في مسيرتك.

source: View archive
ar: شاهد تقدمك في الأرشيف

# reviewTitle
source: Review & Reinforcement
ar: المراجعة والترسيخ

# reviewContent
source: Memorization is capital, and review is the profit. • Review: A dedicated page to help you stay reminded. • Connection: To ensure coherence between verses and surahs.
ar: الحفظ رأس المال، والمراجعة هي الربح. • المراجعة: خصصنا صفحة مستقلة للتذكير. • الربط: لضمان ترابط الآيات والسور.

# masteryTitle
source: Understanding & Mastery
ar: الفهم والإتقان

# masteryContent
source: Make memorization meaningful through understanding: • Tajweed. • Tafsir. • The Holy Mushaf.
ar: اجعل الحفظ مقرونًا بالفهم: • التجويد. • التفسير. • المصحف الشريف.

# footerMessage
source: May Allah grant you success in what He loves and is pleased with
ar: وفقكم الله لما يحب ويرضى

# tabReview
source: Review
ar: المراجعة

# goToTafsir
source: Go to Tafsir page
ar: انتقل الى صفحة التفسير

# goToMushaf
source: Go to Mushaf page
ar: انتقل الى صفحة المصحف الشريف

# goToQuran
source: Go to Quran page
ar: انتقل الى صفحة القرآن

# goToTajweed
source: Go to Tajweed page
ar: انتقل الى صفحة التجويد

# memrizationPlans
source: Memorization plan
ar: خطة الحفظ

# mushafTab
source: Mushaf
ar: المصحف

# planCompletionTitle
source: Plan completion
ar: نسبة إنجاز الخطة

# completionStatTitle
source: Completion
ar: نسبة الإكمال

# linkedVersesStatTitle
source: Linked verses
ar: الآيات المرتبطة

# reviewedVersesStatTitle
source: Reviewed verses
ar: الآيات المُراجَعة

# totalPartsStatTitle
source: Total parts
ar: إجمالي الأجزاء

# performanceStatTitle
source: Performance
ar: الأداء

# completedDaysStatTitle
source: Completed days
ar: الأيام المكتملة

# completedDaysLabel
source: Completed days
ar: أيام مكتملة

# daysUnit
source: day
ar: يوم

# performanceStatUnit
source: pts
ar: نقطة

# motivationLabel
source: Motivation
ar: رسالة تحفيزية

# progressLabel
source: Your progress
ar: تقدمك

# reminderLabel
source: Reminder
ar: تذكير

# notClassifiedLabel
source: Unclassified
ar: غير مصنف

# reviewScreenTitle
source: Review
ar: المراجعة

# reviewEmptyTitle
source: No reviews right now
ar: لا توجد مراجعات حالياً

# reviewEmptySubtitle
source: Complete memorization and your review plans will appear here automatically.
ar: أكمل الحفظ وستظهر هنا خطط المراجعة تلقائياً.

# reviewDueCount
source: {count} review day(s) due
ar: مطلوب مراجعة {count} يوم

# reviewNoReviewTitle
source: No review available
ar: لا توجد مراجعة

# reviewNoReviewSubtitle
source: This plan currently has no review tasks.
ar: هذه الخطة لا تحتوي على مراجعة حالياً .

# reviewVersesUnavailable
source: Unable to show review verses (review range is incomplete).
ar: تعذر عرض آيات المراجعة (نطاق المراجعة غير مكتمل).

# reviewSheetTitlePrefix
source: Review
ar: مراجعة

# listenButton
source: Listen
ar: استماع

# reviewDoneButton
source: Reviewed
ar: تمت المراجعة

# linkScreenTitle
source: Linking
ar: الربط

# linkDueCount
source: {count} linking tasks due
ar: عليك {count} ربط

# linkEmptyTitle
source: No linking tasks
ar: لا توجد مهام ربط حالياً

# linkEmptySubtitle
source: No linking tasks were configured for this period.
ar: لم يتم إعداد ربط لهذه الفترة حسب الخطة.

# linkNoLinkTitle
source: No linking available
ar: لا يوجد ربط

# linkNoLinkSubtitle
source: This day has no linking task as configured for this plan.
ar: هذا اليوم لا يحتوي على ربط حالياً حسب الخطة.

# linkVersesUnavailable
source: Unable to show linking verses (link range is incomplete).
ar: تعذر عرض آيات الربط (نطاق الربط غير مكتمل).

# linkSheetTitlePrefix
source: Link
ar: ربط

# linkDoneButton
source: Linked
ar: تم الربط

# validationGmailOnlyEmail
source: Please enter a valid email address ending with @gmail.com
ar: يرجى إدخال بريد إلكتروني صحيح ينتهي بـ @gmail.com

# planInProgress
source: In progress
ar: قيد التنفيذ

# planCompleted
source: Completed
ar: تمت بنجاح

# planLockedHint
source: Locked - complete the previous plan
ar: مغلق - أكمل الخطة السابقة

source: Tap to start
ar: اضغط للبدء

# planSwitchedTo
source: Switched to: {planName}
ar: تم التبديل إلى: {planName}

# planMustCompleteToUnlock
source: Sorry, you must complete the current plan to unlock this one.
ar: عذرًا، يجب إتمام الخطة الحالية بالكامل لفتح هذه الخطة.

# mainSection
source: Main
ar: الرئيسية

source: Preferences
ar: التفضيلات

# supportSection
source: Support
ar: الدعم

# accountSection
source: Account
ar: الحساب

# somethingWentWrong
source: Something went wrong. Please try again.
ar: حدث خطأ ما، يرجى المحاولة مرة أخرى.

# quranGreeting
source: Let the Quran be your constant companion
ar: ليكن القرآن رفيقك الدائم

# contactTypeComplaint
source: Complaint
ar: شكوى

# contactTypeNote
source: Note
ar: ملاحظة

# contactTypeIdea
source: Ideas
ar: أفكار

# contactTypeInquiry
source: Inquiry
ar: استفسار

# dialogSuccessTitle
source: Sent Successfully
ar: تم الإرسال بنجاح

# dialogSuccessContent
source: Thank you for contacting us. Your message has been received, and our team will reply to you soon via Email, WhatsApp, or Phone call if necessary.
ar: شكراً لتواصلك معنا. تم استلام رسالتك، وسيقوم فريقنا بالرد عليك قريباً عبر البريد الإلكتروني أو الواتساب، أو عبر الاتصال الهاتفي إن لزم الأمر.

# dialogButtonOk
source: OK
ar: حسناً

# dailyAchievementTitle
source: Daily Achievement
ar: إنجازك اليومي

# dailyAchievementSubtitle
source: Continued memorization leads to completing the Book of Allah regularly.
ar: الاستمرار في الحفظ يوصلك لختم كتاب الله بانتظام.

# dailyTipTitle
source: Tip of the Day
ar: نصيحة اليوم

# dailyTipSubtitle
source: The best among you are those who learn the Quran and teach it.
ar: خيركم من تعلم القرآن وعلمه، واصل المسير.

# dailyPlanTitle
source: Current Plan
ar: خطتك الحالية

# dailyPlanSubtitle
source: Follow your progress in the set plan to ensure firm memorization.
ar: تابع تقدمك في الخطة الموضوعة لضمان رسوخ الحفظ.

source: Number of Verses
ar: عدد الآيات

source: Number of Pages
ar: عدد الأوجه

source: Daily Average
ar: المتوسط اليومي

source: Performance
ar: الأداء

# performanceGood
source: Good
ar: جيد

# currentPlanImportanceTitle
source: Current Plan:
ar: الخطة الحالية:

# mistakesWarning
source: ⚠️ You have {count} mistakes. Please review words in red and correct them to proceed.
ar: ⚠️ لديك {count} أخطاء. يرجى مراجعة الكلمات باللون الأحمر وتصحيحها لتتمكن من الحفظ.

# correctionMismatchError
source: Word does not match the required detail, please try again
ar: الكلمة غير مطابقة للتفصيل المطلوب، حاول مرة أخرى

# correctionTitle
source: Correction ({current}/{total})
ar: تصحيح ({current}/{total})

# actualWordLabel
source: Actual Word
ar: الكلمة الفعلية

# correctionDetailLabel
source: Detail: {detail}
ar: التفصيل: {detail}

# correctionHintText
source: Type the word here...
ar: اكتب الكلمة هنا...

# checkButton
source: Check
ar: تحقق

# writingSuccessSaving
source: Writing successful ✅ Saving...
ar: تمت الكتابة بنجاح ✅ جاري الحفظ...

# warningTitle
source: Warning
ar: تنبيه

# exitWarningMessage
source: You haven't finished writing yet. Do you want to exit and lose current progress?
ar: لم تكمل الكتابة بعد، هل تريد الخروج وفقدان التقدم الحالي؟

# continueButton
source: Continue
ar: استمرار

# exitAnywayButton
source: Exit Anyway
ar: خروج على أي حال

# completeWritingWarning
source: ⚠️ Please complete writing the verses first to fix memorization.
ar: ⚠️ يرجى إكمال كتابة الآيات أولاً لتثبيت الحفظ.

# repetitionRemainingWarning
source: ⚠️ You have {count} more repetitions (required {total}).
ar: ⚠️ بقي عليك تكرار الآيات {count} مرات إضافية (المطلوب {total}).

# listeningRemainingWarning
source: ⚠️ You have {count} more listenings (required {total}).
ar: ⚠️ بقي عليك الاستماع للتلاوة {count} مرات إضافية (المطلوب {total}).

source: Recording plan completion...
ar: جاري تسجيل إتمام الخطة...

# planCompletionSuccess
source: Congratulations! Today's portion completed successfully 🎉
ar: مبارك! تم إتمام ورد اليوم بنجاح 🎉

# savingError
source: Error while saving: {error}
ar: حدث خطأ أثناء الحفظ: {error}

# listeningCompletedSuccess
source: Full listening recorded ✅
ar: تم احتساب استماع كامل ✅

# planCompletedCongrats
source: MashaAllah! You have completed the plan successfully
ar: ما شاء الله! لقد أتممت الخطة بنجاح

# duaMessage
source: May Allah make the Quran a light for you in this world and the hereafter ✨
ar: جعل الله القرآن نوراً لك في الدنيا والآخرة ✨

# chooseNextStep
source: Choose your next step:
ar: اختر خطوتك القادمة:

# allPlansCompleted
source: Well done! You have completed all available plans.
ar: أحسنت! لقد أتممت جميع الخطط المتاحة.

source: Failed to load plans
ar: فشل تحميل الخطط

# failedToLoadPlansWithError
source: Failed to load plans: {error}
ar: فشل تحميل الخطط: {error}

# failedToSwitchPlan
source: Failed to change plan: {error}
ar: فشل تغيير الخطة: {error}

# failedToSwitchPlanTryLater
source: Failed to switch plan. Please try again later.
ar: فشل تبديل الخطة. يرجى المحاولة لاحقاً.

# emptyPlanMessage
source: Sorry, this plan is currently empty
ar: عذراً، هذه الخطة فارغة حالياً

# emptyPlanSubmessage
source: No daily tasks have been added to this plan yet. You can choose another plan to start.
ar: لم تتم إضافة أي مهام يومية لهذه الخطة بعد. يمكنك اختيار خطة أخرى للبدء.

# availablePlansLabel
source: Available Plans:
ar: الخطط المتاحة:

# noOtherPlansAvailable
source: No other plans available currently.
ar: لا توجد خطط أخرى متاحة حالياً.

# failedToLoadData
source: Error loading data
ar: خطأ في تحميل البيانات

# registerHelpNote
source: Quick note before trying again
ar: ملاحظة سريعة قبل المحاولة مرة أخرى

# registerHelpDescription
source: The error might be because the phone number or email is already in use. Verify your data, or log in if you already have an account.
ar: قد يكون سبب الخطأ أن رقم الهاتف أو البريد الإلكتروني مستخدم مسبقًا. تأكد من البيانات، أو سجّل الدخول إذا كان لديك حساب بالفعل.

# loginScreenSubtitle
source: Login to continue and benefit from all the features of the app
ar: سجل دخولك للمتابعة والاستفادة من كافة ميزات التطبيق

# choosePlanOptional
source: Choose a plan (Optional)
ar: اختر خطة (اختياري)

source: Default plan will be used
ar: سيتم استخدام الخطة الافتراضية

# doYouHaveAccount
source: Do you have an account?
ar: هل لديك حساب؟

source: User Guide
ar: دليل المستخدم

source: Continue as Guest
ar: تصفح كزائر

# guestModeTitle
source: Login Required
ar: تسجيل دخول مطلوب

# guestModeMessage
source: Please login to access this feature
ar: يرجى تسجيل الدخول للوصول إلى هذه الميزة

source: Cancel
ar: إلغاء

# loginRequiredTitle
source: Login Required
ar: تسجيل الدخول مطلوب

# loginRequiredMessage
source: Please login to access this feature
ar: عذراً، لا يمكنك عرض الشهادات في وضع الزائر. يرجى تسجيل الدخول للمتابعة.

# reportsGuestMessage
source: Sorry, you cannot view memorization reports in guest mode. Please login to continue.
ar: عذراً، لا يمكنك عرض تقارير الحفظ في وضع الزائر. يرجى تسجيل الدخول للمتابعة.

# deleteAccountButton
source: Delete Account
ar: حذف الحساب

# deleteAccountTitle
source: Delete Account
ar: حذف الحساب

# deleteAccountWarning
source: Are you sure you want to delete your account?
ar: سيتم حذف جميع بياناتك نهائياً ولا يمكن التراجع عن هذا الإجراء. هل أنت متأكد؟

# deleteAccountConfirmButton
source: Delete
ar: نعم، حذف الحساب

# deleteAccountSuccess
source: Account deleted successfully
ar: تم حذف الحساب بنجاح

# deleteAccountFailed
source: Failed to delete account: {error}
ar: فشل حذف الحساب: {error}
